benchmarks/new-results-straight.txt
redis-benchmark -c 40 -n 100000
====== PING (inline) ======
  100000 requests completed in 1.97 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

96.26% <= 1 milliseconds
98.78% <= 2 milliseconds
99.44% <= 3 milliseconds
99.76% <= 4 milliseconds
99.90% <= 5 milliseconds
99.96% <= 8 milliseconds
100.00% <= 8 milliseconds
50890.59 requests per second

====== PING ======
  100000 requests completed in 1.80 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.54% <= 1 milliseconds
100.00% <= 1 milliseconds
55586.44 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 3.34 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

11.33% <= 1 milliseconds
99.16% <= 2 milliseconds
99.94% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
29931.16 requests per second

====== SET ======
  100000 requests completed in 2.00 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.01% <= 1 milliseconds
100.00% <= 2 milliseconds
49975.02 requests per second

====== GET ======
  100000 requests completed in 1.93 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

97.53% <= 1 milliseconds
99.94% <= 2 milliseconds
100.00% <= 2 milliseconds
51813.47 requests per second

====== INCR ======
  100000 requests completed in 2.02 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

98.56% <= 1 milliseconds
100.00% <= 1 milliseconds
49431.54 requests per second

====== LPUSH ======
  100000 requests completed in 1.96 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

98.77% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 3 milliseconds
50968.40 requests per second

====== LPOP ======
  100000 requests completed in 1.95 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.19% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
51177.07 requests per second

====== SADD ======
  100000 requests completed in 1.94 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.30% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
51440.33 requests per second

====== SPOP ======
  100000 requests completed in 1.86 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.28% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
53763.44 requests per second

====== LPUSH (again, in order to bench LRANGE) ======
  100000 requests completed in 1.94 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

99.04% <= 1 milliseconds
99.98% <= 2 milliseconds
99.99% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 4 milliseconds
51466.80 requests per second

====== LRANGE (first 100 elements) ======
  100000 requests completed in 2.61 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

36.33% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
38328.86 requests per second

====== LRANGE (first 300 elements) ======
  100000 requests completed in 3.50 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

38.14% <= 1 milliseconds
99.39% <= 2 milliseconds
99.97% <= 3 milliseconds
99.99% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
28595.94 requests per second

====== LRANGE (first 450 elements) ======
  100000 requests completed in 4.26 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

25.58% <= 1 milliseconds
87.25% <= 2 milliseconds
99.94% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
23501.76 requests per second

====== LRANGE (first 600 elements) ======
  100000 requests completed in 5.50 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

5.36% <= 1 milliseconds
37.75% <= 2 milliseconds
96.55% <= 3 milliseconds
99.05% <= 4 milliseconds
99.53% <= 5 milliseconds
99.80% <= 6 milliseconds
99.85% <= 7 milliseconds
99.93% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
18175.21 requests per second