benchmarks/new-results-with-proxy.txt
redis-benchmark -c 40 -n 100000 -p 9999
====== PING (inline) ======
  100000 requests completed in 9.33 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.06% <= 2 milliseconds
8.47% <= 3 milliseconds
92.56% <= 4 milliseconds
97.92% <= 5 milliseconds
98.42% <= 6 milliseconds
98.98% <= 7 milliseconds
99.79% <= 8 milliseconds
99.93% <= 9 milliseconds
99.96% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
10719.26 requests per second

====== PING ======
  100000 requests completed in 9.25 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
8.02% <= 3 milliseconds
96.15% <= 4 milliseconds
98.84% <= 5 milliseconds
98.99% <= 6 milliseconds
99.27% <= 7 milliseconds
99.94% <= 8 milliseconds
99.96% <= 9 milliseconds
99.96% <= 12 milliseconds
99.96% <= 13 milliseconds
99.97% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 17 milliseconds
10815.49 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 10.39 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.04% <= 2 milliseconds
0.31% <= 3 milliseconds
61.91% <= 4 milliseconds
95.05% <= 5 milliseconds
95.73% <= 6 milliseconds
96.31% <= 7 milliseconds
98.33% <= 8 milliseconds
99.75% <= 9 milliseconds
99.84% <= 10 milliseconds
99.88% <= 11 milliseconds
99.89% <= 12 milliseconds
99.92% <= 13 milliseconds
99.92% <= 17 milliseconds
99.92% <= 18 milliseconds
99.94% <= 19 milliseconds
99.96% <= 20 milliseconds
99.96% <= 21 milliseconds
99.96% <= 22 milliseconds
99.96% <= 34 milliseconds
99.96% <= 35 milliseconds
99.97% <= 36 milliseconds
99.97% <= 37 milliseconds
99.97% <= 41 milliseconds
99.97% <= 42 milliseconds
99.97% <= 43 milliseconds
99.98% <= 44 milliseconds
99.99% <= 45 milliseconds
100.00% <= 47 milliseconds
100.00% <= 48 milliseconds
9623.71 requests per second

====== SET ======
  100000 requests completed in 9.64 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.43% <= 3 milliseconds
94.42% <= 4 milliseconds
98.09% <= 5 milliseconds
98.24% <= 6 milliseconds
98.42% <= 7 milliseconds
99.82% <= 8 milliseconds
99.95% <= 9 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
10371.29 requests per second

====== GET ======
  100000 requests completed in 9.28 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.02% <= 2 milliseconds
6.61% <= 3 milliseconds
95.86% <= 4 milliseconds
98.83% <= 5 milliseconds
98.96% <= 6 milliseconds
99.24% <= 7 milliseconds
99.91% <= 8 milliseconds
99.96% <= 9 milliseconds
100.00% <= 9 milliseconds
10779.35 requests per second

====== INCR ======
  100000 requests completed in 10.21 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.03% <= 3 milliseconds
47.57% <= 4 milliseconds
96.98% <= 5 milliseconds
97.46% <= 6 milliseconds
97.81% <= 7 milliseconds
98.93% <= 8 milliseconds
99.78% <= 9 milliseconds
99.93% <= 10 milliseconds
99.95% <= 11 milliseconds
99.96% <= 12 milliseconds
99.97% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 17 milliseconds
100.00% <= 24 milliseconds
9795.28 requests per second

====== LPUSH ======
  100000 requests completed in 10.33 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.05% <= 3 milliseconds
31.04% <= 4 milliseconds
97.93% <= 5 milliseconds
98.07% <= 6 milliseconds
98.17% <= 7 milliseconds
98.87% <= 8 milliseconds
99.93% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 13 milliseconds
9680.54 requests per second

====== LPOP ======
  100000 requests completed in 10.56 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.04% <= 3 milliseconds
18.23% <= 4 milliseconds
98.06% <= 5 milliseconds
98.25% <= 6 milliseconds
98.31% <= 7 milliseconds
98.71% <= 8 milliseconds
99.93% <= 9 milliseconds
99.98% <= 10 milliseconds
100.00% <= 14 milliseconds
9468.80 requests per second

====== SADD ======
  100000 requests completed in 10.21 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.05% <= 2 milliseconds
3.71% <= 3 milliseconds
37.06% <= 4 milliseconds
96.97% <= 5 milliseconds
97.68% <= 6 milliseconds
98.27% <= 7 milliseconds
99.05% <= 8 milliseconds
99.70% <= 9 milliseconds
99.87% <= 10 milliseconds
99.93% <= 11 milliseconds
99.94% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
9797.20 requests per second

====== SPOP ======
  100000 requests completed in 10.06 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
3.75% <= 3 milliseconds
39.02% <= 4 milliseconds
98.71% <= 5 milliseconds
98.87% <= 6 milliseconds
99.01% <= 7 milliseconds
99.45% <= 8 milliseconds
99.88% <= 9 milliseconds
99.96% <= 10 milliseconds
100.00% <= 13 milliseconds
100.00% <= 14 milliseconds
9938.38 requests per second

====== LPUSH (again, in order to bench LRANGE) ======
  100000 requests completed in 10.83 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.02% <= 2 milliseconds
0.06% <= 3 milliseconds
12.40% <= 4 milliseconds
97.65% <= 5 milliseconds
97.86% <= 6 milliseconds
97.99% <= 7 milliseconds
98.38% <= 8 milliseconds
99.82% <= 9 milliseconds
99.92% <= 11 milliseconds
99.97% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 15 milliseconds
100.00% <= 17 milliseconds
9234.46 requests per second

====== LRANGE (first 100 elements) ======
  100000 requests completed in 11.20 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.03% <= 2 milliseconds
0.14% <= 3 milliseconds
18.31% <= 4 milliseconds
93.68% <= 5 milliseconds
97.07% <= 6 milliseconds
97.45% <= 7 milliseconds
97.93% <= 8 milliseconds
98.79% <= 9 milliseconds
99.20% <= 10 milliseconds
99.33% <= 11 milliseconds
99.66% <= 12 milliseconds
99.88% <= 13 milliseconds
99.95% <= 14 milliseconds
99.99% <= 15 milliseconds
99.99% <= 16 milliseconds
99.99% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 19 milliseconds
8926.18 requests per second

====== LRANGE (first 300 elements) ======
  100000 requests completed in 12.83 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.00% <= 3 milliseconds
1.66% <= 4 milliseconds
59.67% <= 5 milliseconds
96.11% <= 6 milliseconds
96.35% <= 7 milliseconds
96.41% <= 8 milliseconds
96.67% <= 9 milliseconds
98.08% <= 10 milliseconds
98.84% <= 11 milliseconds
98.91% <= 12 milliseconds
99.43% <= 13 milliseconds
99.85% <= 14 milliseconds
99.92% <= 15 milliseconds
99.93% <= 16 milliseconds
99.95% <= 17 milliseconds
99.97% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 20 milliseconds
7794.84 requests per second

====== LRANGE (first 450 elements) ======
  100000 requests completed in 13.90 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.07% <= 3 milliseconds
0.25% <= 4 milliseconds
23.37% <= 5 milliseconds
92.12% <= 6 milliseconds
94.45% <= 7 milliseconds
94.85% <= 8 milliseconds
95.20% <= 9 milliseconds
96.10% <= 10 milliseconds
97.88% <= 11 milliseconds
98.29% <= 12 milliseconds
98.52% <= 13 milliseconds
99.41% <= 14 milliseconds
99.72% <= 15 milliseconds
99.77% <= 16 milliseconds
99.85% <= 17 milliseconds
99.87% <= 18 milliseconds
99.94% <= 19 milliseconds
99.97% <= 20 milliseconds
99.99% <= 21 milliseconds
100.00% <= 22 milliseconds
100.00% <= 23 milliseconds
7194.76 requests per second

====== LRANGE (first 600 elements) ======
  100000 requests completed in 14.81 seconds
  40 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.00% <= 3 milliseconds
0.02% <= 4 milliseconds
2.17% <= 5 milliseconds
87.78% <= 6 milliseconds
94.89% <= 7 milliseconds
95.43% <= 8 milliseconds
95.49% <= 9 milliseconds
95.53% <= 10 milliseconds
96.68% <= 11 milliseconds
98.05% <= 12 milliseconds
98.19% <= 13 milliseconds
98.57% <= 14 milliseconds
99.53% <= 15 milliseconds
99.71% <= 16 milliseconds
99.81% <= 17 milliseconds
99.85% <= 18 milliseconds
99.91% <= 19 milliseconds
99.95% <= 20 milliseconds
99.98% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
6753.56 requests per second